Repository: quasarresearchgroup/iscte50anos-app
Catalog: lib/l10n/app_*.arb
Languages: pt

# scanCodeButton
source: Scan Spot
pt: Digitalizar Spot

source: Create Code
pt: Criar Código

# scanACode
source: Scan a Spot
pt: Digitalize um Spot

# noPages
source: No Pages visited yet
pt: Ainda não visitou páginas

source: Loading...
pt: A carregar...

# advance
source: Forward
pt: Avançar

# quizComplete
source: Quiz completed
pt: Quiz concluído

# logOutButton
source: Log Out
pt: Encerrar Sessão

# generalError
source: Error
pt: Erro

# noMoreDataError
source: No more Data
pt: Sem mais dados

source: Network Error
pt: Erro de conecção

source: Random
pt: Aleatório

# leaderBoardScreen
source: Leaderboard
pt: Ranking

# visitedPagesScreen
source: Visited Pages
pt: Páginas Visitadas

# timelineScreen
source: Chronology 50 years Iscte
pt: Linha do Tempo

# timelineDetailsScreen
source: Details
pt: Detalhes

# settingsScreen
source: Settings
pt: Definições

# registerScreen
source: Sign In
pt: Registar

# loginScreen
source: Login
pt: Entrar

# profileScreen
source: Profile
pt: Perfil

# qrScanResultScreen
source: Contents from the Spot
pt: Conteudos do Spot

# spotChooserScreen
source: Choose the next spot
pt: Escolha o próximo spot

# loginInvalidCredentials
source: Invalid Credentials
pt: Credenciais inválidos

# loginDontHaveAccount
source: Dont have an account?
pt: Não tens conta?

# loginRegisterButton
source: Sign up!
pt: Regista-te!

# loginAlreadyHaveAccount
source: Already have an account?
pt: Já tens conta?

# loginLoginButton
source: Log in!
pt: Entra!

# loginPassword
source: Password
pt: Palavra passe

# loginUsername
source: Username
pt: Nome de Utilizador

source: Next
pt: Próximo

source: Back
pt: Voltar

source: Dismiss
pt: Ok

source: Get Started!
pt: Começa!

# onboardingTitle1
source: Access to the App
pt: Acesso à app

# onboardingText1
source: Use the Credentials given to you by our staff so you can participate in the game using the app.
pt: Usa os credenciais dados pela nossa staff para poderes participar no jogo com a app.

# onboardingTitle2
source: The IscteSpots game
pt: O jogo dos IscteSpots

# onboardingText2
source: In order to get to know Iscte's spots better we set up this game. Maybe you will find some interestng places... or some history about our university.
pt: Para conheceres melhor os Spots do Iscte criámos este jogo. Talvez vás encontrar alguns sitios interessantes... ou alguma história sobre a nossa Universidade

# onboardingTitle3
source: Complete the puzzle
pt: Completa o puzzle

# onboardingText3
source: Use the puzzle to understand where the next spot is...
pt: Usa o puzzle para perceber onde é o próximo Spot...

# onboardingTitle4
source: Find the spot
pt: Encontra o Spot

# onboardingText4
source: After completing the puzzle look for the spot displayed in the puzzle! Ask the locals if you find yourself lost.
pt: Depois de completar o puzzle procura pelo Spot da imagem no Campus! Pergunta aos locais se te sentires perdido.

# onboardingTitle5
source: Check your ranking
pt: Vê o teu ranking

# onboardingText5
source: Check how your peers are doing on the Leaderboard. You can be faster than them right?
pt: Vê como os teus colegas se estão a safar na leaderboard! Tu consegues ser mais rápido que eles certo?

# onboardingTitle6
source: Repeat until you win
pt: Repete até ganhares!

# onboardingText6
source: Now do it again! Until you find all the spots hidden on ISCTE
pt: Agora faz outra vez! Até encontrares todos os Spots escondidos do ISCTE

# qrScanNotificationLoginError
source: Authentication Error
pt: Erro de Autenticação

# qrScanNotificationConnectionError
source: Connection Error
pt: Erro de connecção

# qrScanNotificationWrongSpot
source: That's the wrong Spot
pt: Esse é o Spot errado

# qrScanNotificationError
source: Unknown Error
pt: Erro desconhecido

# qrScanNotificationAlreadeyVisited
source: You already visited that Spot
pt: Já visitaste esse Spot

# qrScanNotificationInvalid
source: Are you sure that is a Spot at Iscte?
pt: Tens a certeza que esse é um Spot do Iscte?

# qrScanNotificationDisabled
source: Spots are disabled now...
pt: Os Spots estão desabilitados agora...

# qrScanNotificationAllVisited
source: Good! You finished the task. Now go to the meeting point.
pt: Boa! Terminaste a tarefa. Agora vai ter ao ponto de encontro.

# qrScanNotificationFoundSpot
source: Wow you found the spot!!
pt: Wow encontraste o Spot!!

# qrScanConfirmation
source: Are you sure you want to scan this spot?
pt: Tens a certeza que queres fazer scan a este spot?

# qrScanConfirmationAccept
source: ACCEPT
pt: ACEITAR

# qrScanConfirmationCancel
source: CANCEL
pt: CANCELAR

# timelineSearchResults
source: Search results
pt: Resultados da pesquisa

# timelineNothingFound
source: Nothing found!
pt: Nada encontrado...

# timelineAvailableTopics
source: Topics
pt: Tópicos disponiveis...

# timelineSelectedTopics
source: Selected Topics
pt: Tópicos selecionados

# timelineSearchHint
source: Search
pt: Pesquise

# timelineSearchHintInsideTopic
source: Advanced search
pt: Pesquisa avançada

# timelineSearchButton
source: Submit
pt: Submeter

# timelineSelectAllButton
source: Select all
pt: Escolher tudo

# timelineSelectClearButton
source: Clear selection
pt: Limpar seleção
